#include <stdio.h>

int main(void){
// Змінні для даних студентів
    int student_id1 = 1, student_id2 = 2;

    char name1[60], name2[60];

    char email1[50], email2[50];

    char color1[30], color2[30];
// Введення даних студентів користувачем
    printf("Введіть дані першого студента \n");
    printf("Введіть прізвище та ініціали, замість пробілів викор '_' (Наприклад: Постернак_Т.О): ");
    scanf("%29s", name1);
    printf("Введіть електронну пошту: ");
    scanf("%39s", email1);
    printf("Введіть улюблений колір: ");
    scanf("%19s", color1);

    printf("Введіть дані другого студента \n");
    printf("Введіть прізвище та ініціали, замість пробілів викор '_' (Наприклад: Постернак_Т.О): ");
    scanf("%29s", name2);
    printf("Введіть електронну пошту: ");
    scanf("%39s", email2);
    printf("Введіть улюблений колір: ");
    scanf("%19s", color2);

// Виведення таблиці
    printf("\n=============================================================================\n");
    printf("| %-5s | %-22s | %-25s | %-12s |\n", "№ п/п", "Прізвище, Ініціали", "Ел. пошта", "Улюб. колір");
    printf("=============================================================================\n");
    printf("| %-5d | %-22s | %-25s | %-12s |\n", student_id1, name1, email1, color1);
    printf("| %-5d | %-22s | %-25s | %-12s |\n", student_id2, name2, email2, color2);
    printf("=============================================================================\n");
    return 0;
}